//&НаСервере
//Функция ПечатнаяФорма(ПараметрКоманды)
//	ТабличныйДокумент = Новый ТабличныйДокумент;
//	ТабличныйДокумент.ОтображатьСетку = Ложь;
//	ТабличныйДокумент.Защита = Ложь;
//	ТабличныйДокумент.ТолькоПросмотр = Ложь;
//	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
//	ТабличныйДокумент.ПолеСверху = 2;
//	ТабличныйДокумент.ПолеСнизу = 2;
//	ТабличныйДокумент.ПолеСправа = 2;
//	ТабличныйДокумент.ПолеСлева = 2;
//	ТабличныйДокумент.РазмерКолонтитулаСверху = 0;
//	ТабличныйДокумент.РазмерКолонтитулаСнизу = 0;
//	
//	Сформирован = Ложь;
//	
//	Для Каждого Ссылка Из ПараметрКоманды Цикл
//		Документ = Ссылка.ПолучитьОбъект();
//		//Если Не Документ.Проведен Тогда
//		//	Сообщение = Новый СообщениеПользователю();
//		//	Сообщение.Текст = "Документ не проведен: " + Строка(Документ);
//		//	Сообщение.КлючДанных = Ссылка;
//		//	Сообщение.Сообщить();
//		//	Продолжить;
//		//КонецЕсли;	
//		Документ.Печать(ТабличныйДокумент);
//		Сформирован = Истина;
//	КонецЦикла;	
//	
//	Если Сформирован Тогда
//		Возврат ТабличныйДокумент;
//	Иначе 	
//		Возврат Неопределено;
//	КонецЕсли;	
//	
//КонецФункции

//&НаКлиенте
//Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
//	ТабличныйДокумент = ПечатнаяФорма(ПараметрКоманды);
//	
//	Если ТабличныйДокумент <> Неопределено Тогда
//		ТабличныйДокумент.Показать();
//		//ТабличныйДокумент.Напечатать();
//	КонецЕсли;

//КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
    //{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
    ТабДок = Новый ТабличныйДокумент;
    Печать(ТабДок, ПараметрКоманды);

    ТабДок.ОтображатьСетку = Ложь;
    ТабДок.Защита = Ложь;
    ТабДок.ТолькоПросмотр = Ложь;
    ТабДок.ОтображатьЗаголовки = Ложь;
    ТабДок.Показать();
    //}}
КонецПроцедуры

&НаСервере
Процедура Печать(ТабДок, ПараметрКоманды)
    Документы.Задание.Печать(ТабДок, ПараметрКоманды);
КонецПроцедуры
