// Процедура заполнения ПерсональныеНастройки   - для кеширования на клиенте
//
Функция ЗаполнитьПерсональныеНастройки() Экспорт
	ПерсональныеНастройки = Новый Структура;
	
	//КакОткрывать = ДействиеПоДвойномуЩелчкуМыши();	
	//ПерсональныеНастройки.Вставить("ДействиеПоДвойномуЩелчкуМыши", КакОткрывать);
	//
	//СпрашиватьРежимРедактированияПриОткрытииДокумента = РаботаСДокументамиСервер.СпрашиватьРежимРедактированияПриОткрытииДокумента();
	//ПерсональныеНастройки.Вставить("СпрашиватьРежимРедактированияПриОткрытииДокумента", СпрашиватьРежимРедактированияПриОткрытииДокумента);
	//
	//МаксимальныйРазмерРабочегоКаталога = РаботаСДокументамиСервер.ХранилищеОбщихНастроекЗагрузить("РабочийКаталог", "МаксимальныйРазмерРабочегоКаталога");
	//Если МаксимальныйРазмерРабочегоКаталога = Неопределено Тогда
	//	МаксимальныйРазмерРабочегоКаталога = 100*1024*1024; // 100 мб		
	//	РаботаСДокументамиСервер.ХранилищеОбщихНастроекСохранить("РабочийКаталог", "МаксимальныйРазмерРабочегоКаталога", МаксимальныйРазмерРабочегоКаталога);
	//КонецЕсли;
	//ПерсональныеНастройки.Вставить("МаксимальныйРазмерРабочегоКаталога", МаксимальныйРазмерРабочегоКаталога);

	//ПерсональныеНастройки.Вставить("УчитыватьNTFSКоррекцию", ПолучитьУчитыватьNTFSКоррекцию());

	//ПутьКРабочемуКаталогу = РаботаСДокументамиСервер.ХранилищеОбщихНастроекЗагрузить("РабочийКаталог", "ПутьКРабочемуКаталогу");
	//ПерсональныеНастройки.Вставить("ПутьКРабочемуКаталогу", ПутьКРабочемуКаталогу);
	//
	//УдалятьФайлИзРабочегоКаталогаПриЗавершенииРедактирования = РаботаСДокументамиСервер.ХранилищеОбщихНастроекЗагрузить("РабочийКаталог", "УдалятьФайлИзРабочегоКаталогаПриЗавершенииРедактирования");
	//ПерсональныеНастройки.Вставить("УдалятьФайлИзРабочегоКаталогаПриЗавершенииРедактирования", УдалятьФайлИзРабочегоКаталогаПриЗавершенииРедактирования);
	//
	//РольДоступнаПолныеПрава = РольДоступна("ПолныеПрава");
	//ПерсональныеНастройки.Вставить("РольДоступнаПолныеПрава", РольДоступнаПолныеПрава);
	//
	//ИзвлекатьТекстыФайловНаСервере = Константы.ИзвлекатьТекстыФайловНаСервере.Получить();
	//ПерсональныеНастройки.Вставить("ИзвлекатьТекстыФайловНаСервере", ИзвлекатьТекстыФайловНаСервере);
	//
	//МаксимальныйРазмерФайла = Константы.МаксимальныйРазмерФайла.Получить();
	//ПерсональныеНастройки.Вставить("МаксимальныйРазмерФайла", МаксимальныйРазмерФайла);
	//
	//БиблиотекаКартинокИнформация32 = БиблиотекаКартинок.Информация32;
	//ПерсональныеНастройки.Вставить("БиблиотекаКартинокИнформация32", БиблиотекаКартинокИнформация32);

	//ОткрыватьНачалоРаботы = РаботаСДокументамиСервер.ХранилищеОбщихНастроекЗагрузить("НастройкиПрограммы", "ОткрыватьНачалоРаботыПриЗапуске");
	//Если ОткрыватьНачалоРаботы = Неопределено Тогда
	//	ОткрыватьНачалоРаботы = Истина;
	// КонецЕсли;
	//ПерсональныеНастройки.Вставить("ОткрыватьНачалоРаботы", ОткрыватьНачалоРаботы);
	
	//{[+] Инфостарт А.Васильев 26.04.2022 #
	//ПерсональныеНастройки.Вставить("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);	
    //} Инфостарт А.Васильев 26.04.2022
		
	ПерсональныеНастройки.Вставить("ЭтоПостановщик", РольДоступна("Постановщик"));	
	
	//ПоказыватьПодсказкиПриРедактированииДокументов = РаботаСДокументамиСервер.ХранилищеОбщихНастроекЗагрузить("НастройкиПрограммы", "ПоказыватьПодсказкиПриРедактированииДокументов");
	//Если ПоказыватьПодсказкиПриРедактированииДокументов = Неопределено Тогда
	//	ПоказыватьПодсказкиПриРедактированииДокументов = Истина;
	//	РаботаСДокументамиСервер.ХранилищеОбщихНастроекСохранить("НастройкиПрограммы", "ПоказыватьПодсказкиПриРедактированииДокументов", ПоказыватьПодсказкиПриРедактированииДокументов);
	//КонецЕсли;
	//ПерсональныеНастройки.Вставить("ПоказыватьПодсказкиПриРедактированииДокументов", ПоказыватьПодсказкиПриРедактированииДокументов);

	Возврат ПерсональныеНастройки;
КонецФункции
