
Процедура УстановкаПараметровСеанса(ПараметрыСеанса)
	
	// УниверсальныеМеханизмы
	Если ПараметрыСеанса = Неопределено Тогда
		
		// раздел безусловной установки параметров сеанса
		УправлениеСпискомПользователейПолныеПрава.ОпределитьТекущегоПользователя();
	// Конец УниверсальныеМеханизмы
	
	// Переопределяемый блок
	// ...
	
	// Конец переопределяемого блока
	
	// УниверсальныеМеханизмы
	Иначе		
		// установка параметров сеанса "по требованию"
		
		// параметры сеанса, инициализация которых требует обращения к одним и тем же данным
		// следует инициализировать сразу группой. для того, чтобы избежать их повтроной инициализации, 
		// имена уже установленных параметров сеанса сохраняются в структуре УстановленныеПараметры
		УстановленныеПараметры = Новый Структура;		
		Для Каждого ИмяПараметра ИЗ ПараметрыСеанса Цикл
			УстановитьЗначениеПараметраСеанса(ИмяПараметра, УстановленныеПараметры);
		КонецЦикла;
		
	КонецЕсли;
	// Конец УниверсальныеМеханизмы
КонецПроцедуры

Процедура УстановитьЗначениеПараметраСеанса(ИмяПараметра, УстановленныеПараметры)
	
	// Конец УниверсальныеМеханизмы
	Если УстановленныеПараметры.Свойство(ИмяПараметра) Тогда
		Возврат;
	КонецЕсли;
	// Конец УниверсальныеМеханизмы
	
	// Переопределяемый блок
	
	// Дописывается по шаблону:	
	//Если ИмяПараметра = <ИмяПараметра> Тогда		
	//	УстановленныеПараметры.Вставить(<ИмяПараметра>);
	//КонецЕсли;
	
	Если ИмяПараметра = "ИспользоватьОграниченияПравДоступаНаУровнеЗаписей" Тогда
		ПолныеПрава.УстановитьПараметрыМеханизмаОграниченияПрав();
		УстановленныеПараметры.Вставить("ИспользоватьОграниченияПравДоступаНаУровнеЗаписей");
	КонецЕсли;

	// Конец переопределяемого блока

КонецПроцедуры

