
&НаКлиенте
Процедура Сохранить(Команда)
    Если НовыйПароль="" Тогда
    	Предупреждение("Введен пустой пароль!
                        |Сохранение не возможно!");
        Возврат;
    КонецЕсли;
    Если НовыйПароль <> НовыйПароль2 Тогда
        Предупреждение("Пароль и подтверждение пароля не совпадают!");
    Иначе    
        ИзменитьпарольПользователя(НовыйПароль);
        Состояние("Новый пароль успешно сохранён!");
        ЭтаФорма.Закрыть();
    КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ИзменитьпарольПользователя(НовыйПароль)
    ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
    
    ТекущийПользователь.Пароль = НовыйПароль;
    ТекущийПользователь.Записать();
КонецПроцедуры
