
Процедура ОбновлениеИндекса() Экспорт

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Запуск регламентного задания Обновление индекса  " + ТекущаяДата();
	Сообщение.Сообщить();

	Если ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() =  РежимПолнотекстовогоПоиска.Разрешить Тогда
		Если Не ПолнотекстовыйПоиск.ИндексАктуален() Тогда
			ПолнотекстовыйПоиск.ОбновитьИндекс( , Истина);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура СлияниеИндексов() Экспорт
	
	Если ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() =  РежимПолнотекстовогоПоиска.Разрешить Тогда
		Если Не ПолнотекстовыйПоиск.ИндексАктуален() Тогда
			ПолнотекстовыйПоиск.ОбновитьИндекс(Истина);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ОтправитьПисьмоДляЗаполненияТЛиста() Экспорт
	
	Тема = "Внимание 5 минут до конца рабочего дня заполните т-лист: " + Формат(ТекущаяДата(), "ДЛФ=DT");
	ВидПочтовогоСообщения =  Тема + " Заполните т-лист!";
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Пользователи.Ссылка,
	                      |	Пользователи.ПочтовыйАдрес
	                      |ИЗ
	                      |	Справочник.Пользователи КАК Пользователи
	                      |ГДЕ
	                      |	Пользователи.УчаствуетВРассылке = ИСТИНА");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЭкспортируемыеПодпрограммы.ПослатьСообщение(Выборка.ПочтовыйАдрес, ВидПочтовогоСообщения, Тема, Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры
