
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//мГлавныйПользователь = ПараметрыСеанса.ТекущийПользователь.Ссылка;
	
	СделатьПредварительныеНастройкиОтбора();
	
КонецПроцедуры

&НаСервере
Процедура СделатьПредварительныеНастройкиОтбора()
	
	//Если РольДоступна("Постановщик") Тогда
	//	Возврат;
	//КонецЕсли; 
	//
	
	СписокСтатусовКПоказу = Новый СписокЗначений;
	
	СписокСтатусовКПоказу.Добавить(Перечисления.Статус.Выполняется);
	СписокСтатусовКПоказу.Добавить(Перечисления.Статус.Новое);
	СписокСтатусовКПоказу.Добавить(Перечисления.Статус.Ожидает);
	//==#ivs#== Дорин Д.И. t-list: begin 17-06-2020
	СписокСтатусовКПоказу.Добавить(Перечисления.Статус.ВыполненоОжидаетПриемки);
	СписокСтатусовКПоказу.Добавить(Перечисления.Статус.Выполнено);
	СписокСтатусовКПоказу.Добавить(Перечисления.Статус.Отложено);
	//==#ivs#== Дорин Д.И. t-list: end 17-06-2020
	
	Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.Использование = Истина;
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус");
	Отбор.ПравоеЗначение = СписокСтатусовКПоказу;
	//Отбор.Режимотображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.Использование = Ложь;
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Заказчик");
	
	//{[+] А.Васильев 26.04.2022 #	
	//Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//Отбор.Использование = Ложь;
	//Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокИсполнителей.Исполнитель");
	////Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОтветственныйИсполнитель");
	//Отбор.ПравоеЗначение = ПараметрыСеанса.ТекущийПользователь; 
   	
	//Если РольДоступна("Постановщик") Тогда
	//	Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//	Отбор.Использование = Ложь;
	//	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Постановщик");
	//	Отбор.ПравоеЗначение = ПараметрыСеанса.ТекущийПользователь; 
	//КонецЕсли;
	//} А.Васильев 26.04.2022

КонецПроцедуры
 

&НаКлиенте
Процедура ОтладкаВыполнить()
	чч = мГлавныйПользователь;
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	СделатьПредварительныеНастройкиОтбора();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПоИсполнителюВыполнить()

	ЭтаФорма.Элементы.ФильтрПоИсполнителю.Пометка = ПереключитьОтборПоЭлементу("СписокИсполнителей.Исполнитель");
    //ЭтаФорма.Элементы.ФильтрПоИсполнителю.Пометка = ПереключитьОтборПоЭлементу("ОтветственныйИсполнитель");
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПоПостановщикуВыполнить()
	
	ЭтаФорма.Элементы.ФильтрПоПостановщику.Пометка = ПереключитьОтборПоЭлементу("Постановщик");
	Элементы.Список.Обновить();
	
КонецПроцедуры
 
&НаКлиенте
Процедура ФильтрПоСтатусуВыполнить()
	
	Включен = ПереключитьОтборПоЭлементу("Статус");
	Элементы.Список.Обновить();
	
//	мЗаголовок = "Статус ("+?(Включен,"+","-")+")";
	//мЗаголовок = ?(Включен,"+","-")+"Статус";
	//ЭтаФорма.Элементы.ФильтрПоСтатусу.Заголовок = мЗаголовок;
	ЭтаФорма.Элементы.ФильтрПоСтатусу.Пометка = Включен;

КонецПроцедуры

&НаСервере
Функция ПереключитьОтборПоЭлементу(Элемент)
	
    ЭлементыОтбора = Список.Отбор.Элементы;
	
    ПолеКомпоновки = Новый ПолеКомпоновкиДанных(Элемент);
    Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		Если ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки Тогда
            ЭлементОтбора.Использование = НЕ ЭлементОтбора.Использование;
			Возврат ЭлементОтбора.Использование;
//			Прервать;
        КонецЕсли;
    КонецЦикла;
	Возврат Ложь;	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.Элементы.ФильтрПоСтатусу.Пометка = Истина;
КонецПроцедуры
 
