  // ПолучитьЗначениеКонстанты НаименованиеКонстанты на определённую дату Период
// Возвращает или значение константы или Неопределено
Функция ПолучитьЗначениеКонстанты(НаименованиеКонстанты, Дата = Неопределено, ВыводитьСообщение = Истина) Экспорт
	
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата();
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ВложенныйЗапрос.Значение,
	               |	ВложенныйЗапрос.Дата КАК Дата
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		КонстантыСрезПоследних.Значение КАК Значение,
	               |		КонстантыСрезПоследних.Период КАК Дата
	               |	ИЗ
	               |		РегистрСведений.ивсКонстанты.СрезПоследних(&Дата, Наименование = &Наименование) КАК КонстантыСрезПоследних) КАК ВложенныйЗапрос
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата УБЫВ";
	Запрос.УстановитьПараметр("Наименование",НаименованиеКонстанты);
	Запрос.УстановитьПараметр("Дата",Дата);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество()>0 Тогда
	    Возврат РезультатЗапроса[0].Значение;
	Иначе
		Если ВыводитьСообщение Тогда
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Не найдена константа: Справочник констант -> "+НаименованиеКонстанты;
			СообщениеПользователю.Сообщить();
		КонецЕсли;
		Возврат Неопределено;	
	КонецЕсли; 

КонецФункции // ПолучитьЗначениеКонстанты()