Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ_ЭЛЕМЕНТ(Печать)
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	//ТабДок = Новый ТабличныйДокумент;
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |   Задание.Дата,
    |   Задание.Комментарий,
    |   Задание.СписокИсполнителей.(
    |       Исполнитель
    |   ),
    |   Задание.Номер КАК Номер,
    |   Задание.Срочность,
    |   Задание.Заказчик,
    |   Задание.Постановщик,
    |   Задание.Конфигурация,
    |   Задание.Тема,
    |   Задание.ТекстЗадания КАК ТекстЗадания
    |ИЗ
    |   Документ.Задание КАК Задание
    |ГДЕ
    |   Задание.Ссылка В(&Ссылка)";
    Запрос.Параметры.Вставить("Ссылка", Ссылка);
    Выборка = Запрос.Выполнить().Выбрать();
    //Выборка.Следующий();
    
    Макет = Документы.Задание.ПолучитьМакет("Печать");
	Область = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
   	Содержание = Макет.ПолучитьОбласть("Комментарий");
    
    ВставлятьРазделительСтраниц = Ложь;
    Пока Выборка.Следующий() Цикл
        Если ВставлятьРазделительСтраниц Тогда
            ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        // Заголовок
        Область.Параметры.Заполнить(Выборка);
        ТабДок.Вывести(Область);
        // Шапка
        Шапка.Параметры.Заполнить(Выборка);
        ТабДок.Вывести(Шапка);
        
        Разделитель = Макет.ПолучитьОбласть("Разделитель");
        ТабДок.Вывести(Разделитель);
        //// Комментарий
        //Комментарий = Макет.ПолучитьОбласть("Комментарий");
        //Комментарий.Параметры.Заполнить(Ссылка);
        //ТабДок.Вывести(Комментарий);
        
        КоличествоСтрок = СтрЧислоВхождений(Выборка.Комментарий, Символы.ПС)+1;
        
        Для СчСтрока=1 По КоличествоСтрок Цикл
            стрПервая = СтрПолучитьСтроку(Выборка.Комментарий, СчСтрока);
            Содержание.Параметры.Комментарий = стрПервая;
            ТабДок.Вывести(Содержание);
        КонецЦикла; 
        ВставлятьРазделительСтраниц = Истина;
    КонецЦикла;

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
    //ТабДок.Показать();
	//}}_КОНСТРУКТОР_ПЕЧАТИ_ЭЛЕМЕНТ
КонецПроцедуры

