
Процедура ПриЗаписи(Отказ)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РелизыКонфигурацийБДСрезПоследних.Конфигурация,
	                      |	РелизыКонфигурацийБДСрезПоследних.ТекущийРелиз
	                      |ИЗ
	                      |	РегистрСведений.РелизыКонфигурацийБД.СрезПоследних(, БазаДанных = &БазаДанных) КАК РелизыКонфигурацийБДСрезПоследних");
	
	Запрос.УстановитьПараметр("БазаДанных", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НеобходимаЗапись = Истина;
	
	Если Выборка.Следующий() Тогда
		НеобходимаЗапись = Не (Выборка.Конфигурация = Конфигурация и Выборка.ТекущийРелиз = РелизКонфигурации);
	КонецЕсли;
	
	Если НеобходимаЗапись Тогда
		НоваяЗапись = РегистрыСведений.РелизыКонфигурацийБД.СоздатьМенеджерЗаписи();
		НоваяЗапись.Период = ТекущаяДата();
		НоваяЗапись.БазаДанных = Ссылка;
		НоваяЗапись.Конфигурация = Конфигурация;
		НоваяЗапись.ТекущийРелиз = РелизКонфигурации;
		НоваяЗапись.Записать();
	КонецЕсли;
	
КонецПроцедуры
