
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
    Если ТипЗнч(Расшифровка) <> Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда
        Возврат;
    КонецЕсли;
    
    СтандартнаяОбработка = Ложь;
    Элемент =  ПолучитьКоллекцию(Расшифровка);
    Если ЗначениеЗаполнено(Элемент) Тогда
        ОткрытьЗначение(Элемент);
    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьКоллекцию(Расшифровка)
    
    ДанныеРасшифровкиОтчета = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
    ЭлементРасшифровки = ДанныеРасшифровкиОтчета.Элементы[Расшифровка];
    
    
    Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
        Для Каждого ЗначениеПоляРасшифровки Из ЭлементРасшифровки.ПолучитьПоля() Цикл
            Значение = ЗначениеПоляРасшифровки.Значение;
            Если Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение))
                ИЛИ Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение)) Тогда
                Возврат Значение;
            КонецЕсли;
        КонецЦикла;
    КонецЕсли;
    
    Возврат Неопределено;
    
КонецФункции 
