////////////////////////////////////////////////////////////////////////////////
// Процедуры, выполнение которых требует привилегированного режима

Процедура ОпределитьТекущегоПользователя() Экспорт
	
	ИмяПользователя = ИмяПользователя();
	ПолноеИмяПользователя = ПолноеИмяПользователя();
	
	Если ПустаяСтрока(ИмяПользователя) Тогда
		ИмяПользователя           = "<Не указан>";
		ПолноеИмяПользователя     = "<Не указан>";
	Иначе
		Если ПустаяСтрока(ПолноеИмяПользователя) Тогда
			ПолноеИмяПользователя = ИмяПользователя;
		КонецЕсли;
	КонецЕсли;
	
	ДопустимаяДлинаИмени = Метаданные.Справочники.Пользователи.ДлинаНаименования;
	Если СтрДлина(ИмяПользователя) > ДопустимаяДлинаИмени Тогда
		ИмяПользователя = Лев(ИмяПользователя, ДопустимаяДлинаИмени);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Наименование = """ + ИмяПользователя + """";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
        //СсылкаНового = Справочники.Пользователи.ПолучитьСсылку();
        //ПараметрыСеанса.ТекущийПользователь = СсылкаНового;
        //
        //НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
        //НовыйПользователь.Код          = ИмяПользователя;
        //НовыйПользователь.Наименование = ПолноеИмяПользователя;
        //НовыйПользователь.УстановитьСсылкуНового(СсылкаНового);
        //
        //Попытка
        //	НовыйПользователь.Записать();
        //Исключение
        //	ВызватьИсключение "Пользователь : " + ИмяПользователя + " не был найден в справочнике пользователей. Возникла ошибка при добавлении пользователя в справочник.
        //		|" + ОписаниеОшибки();
        //КонецПопытки;
		
		//{[+] А.Васильев 26.04.2022 
		//ВызватьИсключение "Пользователь : " + ИмяПользователя + " не был найден в справочнике пользователей. Попросите администратора добавить Вас в справочник!";
		
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ПараметрыСеанса.ТекущийПользователь = Выборка.Ссылка;
	КонецЕсли;
	
КонецПроцедуры
